{
  "basics": {
    "name": "Roshan Jacob Manoj",
    "label": "MS in CS at Arizona State University | Software Engineer@Lumen Technology | Ex-Full Stack Software Developer at Standard Charetered Bank",
    "image": "",
    "email": "rjacobma@asu.edu",
    "phone": "(602) 388-6894",
    "url": "https://roshan-jacob.github.io",
    "summary": "Software Engineer with over 1 year of experience delivering enterprise scalable applications. Proven expertise in creating critical distributed systems such as a trading platform leveraging React, Redux, and Spring Boot, and a highly scalable search engine integrating Elasticsearch Kibana stack with FastAPI. Notable achievements include automating reporting times from hours to milliseconds and implementing CI/CD pipelines as a DevOps Engineer. Looking to leverage development expertise in feature design, implementation, and optimization to meet user requirements and improve product performance",
    "location": {
      "address": "1255 University Dr",
      "postalCode": "AZ 85288",
      "city": "Tempe",
      "countryCode": "US",
      "region": "Arizona"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "roshan1999",
        "url": "https://linkedin.com/in/roshan1999"
      },
      {
        "network": "Github",
        "username": "roshan1999",
        "url": "https://github.com/roshan1999"
      }
    ]
  },
  "work": [
    {
      "name": "Lumen Technology, Remote, USA",
      "position": "Software Engineer",
      "url": "https://lumen.com",
      "startDate": "2024-05-27",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "Engineered a resilient, Elasticsearch Kibana system integrated with an asynchronous FastAPI server and React UI to search across MongoDB documents, Swagger pages, MAL entries and network workflows, significantly outperforming initial response time targets.",
        "Implemented a highly distributed search engine with Docker and leveraging asynchronous programming and advanced storage techniques to maintain sub-5ms response time across over 10k documents.",
      ]
    },
    {
      "name": "Lumen Technology, Tempe, AZ, USA",
      "position": "DevOps Engineer Intern",
      "url": "https://lumen.com",
      "startDate": "2023-06-02",
      "endDate": "2024-05-04",
      "summary": "",
      "highlights": [
        "Enhanced API gateway portal's security by implementing Access Control Lists, JWT authentication, and Role-Based Authorization using Spring Security framework, improving overall system security and aligning with established design practices.",
        "Extended portal functionalities to include LDAP integration, automated admin approval for access requests leveraging Spring Boot, Spring Mail and Java Server Pages (JSP), reducing manual approvals by 60%. This contributed to breaking down larger work items into smaller work items effectively.",
        "Automated reporting of network service outages and changes to clients by developing APIs in Spring Boot, reducing manual reporting time from 1-2 hours to just 400ms per update, showcasing strengths in building services at scale and debugging."
      ]
    },
    {
      "name": "Standard Chartered Bank, Bangalore, KA, India",
      "position": "Full Stack Developer",
      "url": "https://sc.com",
      "startDate": "2021-08-21",
      "endDate": "2022-07-04",
      "summary": "",
      "highlights": [
        "Overhauled legacy portfolio management application catering to 1M+ clients, using React and Spring boot.",
        "Improved application efficiency by 75% using Redux Thunk middleware with Axios for handling asynchronous actions.",
        "Spearheaded integration of Hashicorp vault for secure database connection serving 45+ microservice architectures.",
        "Leveraged Java Persistence API specifications in Spring for filtering, sorting, and pagination of 1M+ records in less than 250ms.",
        "Integrated Hashicorp vault with 30+ microservice architectures for DB connectivity, improving security and efficiency."
      ]
    },
    {
      "name": "Centre for Artificiation Intelligence and Research Labs, India",
      "position": "Research Intern",
      "url": "https://sc.com",
      "startDate": "2021-01-04",
      "endDate": "2022-06-30",
      "summary": "",
      "highlights": [
        "Developed novel Deep Reinforcement Learning algorithm to perform page ranking using Pytorch.",
        "Presented as Bachelor thesis improving on MDPRank using Model-Free RL algorithms like Advantage Actor Critic and Policy Proximal Optimization among other RL algorithms.",
        "Mentored under Mr. Ashish Srivastava (Graduate from IISC. Bangalore, working as a scientist at DRDO).",
        "Beat state-of-the-art results presented by MDPRank and RLIRank papers by 2%."
      ]
    },
    {
      "name": "Standard Chartered Bank, Bangalore, KA, India",
      "position": "Full Stack Mobile Developer Intern",
      "url": "https://sc.com",
      "startDate": "2020-05-15",
      "endDate": "2020-07-30",
      "summary": "",
      "highlights": [
        "Engineered a finance management mobile application automating financial tracking by 75% using Flutter, Python Flask & SQL.",
        "Analyzed preference data collected to integrate a recommendation engine, resulting in a 20% increase in click-through rates.",
        "Integrated features like push notification, deep linking, and charts to enhance user experience improving user retention by 14%."
      ]
    },
    {
      "name": "Customer Xps Solutions, Bangalore, KA, India",
      "position": "Data Science Intern",
      "url": "https://clari5.com",
      "startDate": "2020-05-15",
      "endDate": "2020-07-30",
      "summary": "",
      "highlights": [
        "Architected a company classification Machine Learning model using company proprietary dataset of bank IFSC Code.",
        "Applied both unsupervised and supervised learning machine learning algorithms such as hierarchical clustering, k-means (supervised and unsupervised) classification algorithm, and performed validation, analysis and testing to achieve results.",
        "Resulted in an accuracy of 55-80% in recognizing company names depending on the algorithm used."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Arizona State University, Tempe, Arizona, USA",
      "url": "https://www.asu.edu/",
      "area": "Computer Science (Specialization: Artificial Intelligence)",
      "studyType": "Master of Science",
      "startDate": "2022-08-11",
      "endDate": "2024-05-01",
      "score": "4.0 / 4.0",
      "courses": [
        "Intro To Artificial Intelligence",
        "Mobile Computing",
        "Digital Video Processing",
        "Data Visualization",
        "Knowledge Representation and Reasoning",
        "Data Mining",
        "Semantic Web Mining",
        "Data Processing at Scale",
        "Cloud Computing"
      ]
    },
    {
      "institution": "Manipal Institute of Technology, Manipal, India",
      "url": "https://www.manipal.edu/",
      "area": "Computer Science (Specialization: Big Data)",
      "studyType": "Bachelor of Technology / Bachelor of Science",
      "startDate": "2017-07-07",
      "endDate": "2021-07-07",
      "score": "3.7 / 4.0",
      "courses": [
        "Data Structures",
        "Analaysis of Algoritms",
        "Operating System",
        "Computer Network",
        "Object Oriented Programming",
        "Distributed Systems",
        "Big Data Processing (6 course electives)",
        "Computer Vision (Elective)",
        "Public Speaking (Elective)"
      ]
    }
  ],
  "certificates": [],
  "publications": [],
  "skills": [],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Malayalam",
      "fluency": "Native speaker"
    },
    {
      "language": "Hindi",
      "fluency": "Fluent"
    }
  ],
  "interests": [],
  "references": [],
  "projects": []
}
